Public Member Functions | List of all members
API_IEnableAllInfoDialogEventHandler Class Reference
Notifications Manager
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IEnableAllInfoDialogEventHandler:
 Public Member Functions
virtual GS::UniString  | GetName () const override final
virtual void  | Dispatch (const API_IEventNotifier &eventNotfier) const override final
 virtual GS::UniString  | GetName () const =0
 virtual void  | Dispatch (const API_IEventNotifier &eventNotfier) const =0
 Public Member Functions inherited from API_IDialogEventHandler
 virtual void  | EnableAllInfoDialog () const =0
Detailed Description
The base class you need to inherit from in case you want to handle Info Dialog change event.
Since
Archicad 26
Member Function Documentation
◆ Dispatch()
 virtual void API_IEnableAllInfoDialogEventHandler::Dispatch  |  ( |  const API_IEventNotifier &  |  eventNotfier | ) |   const
inlinefinaloverridevirtual
Implements API_IEventHandler.
◆ GetName()
 virtual GS::UniString API_IEnableAllInfoDialogEventHandler::GetName  |  ( |   | ) |   const
inlinefinaloverridevirtual
Implements API_IEventHandler.